import streamlit as st
# ส่วนหัวข้อเว็บ (Header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน")
st.write("นี้คือเว็บแอปพลิเคชันแรกในชีวิตของผม เขียนด้วยภาษา Python ครับ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

 # ส่วนข้อมูลส่วนตัว (Profile lnfo)
st.header("ข้อมูลส่วนตัว")
st.write("**ชื่่อ-นามสกุล**" นาย อซิตะ อิกำเหนิด)
st.write("**ชั้น ม.4/11**" เลขที่ 16 )
st.write("**โรงเรียน**" ยุพราชวิทยาลัย )

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็๋บครั้งแรก")
    st.success(f"ว้าว สนุกและง่ายกว่าที่คิดมากๆ ")
